{
  "base_model_name_or_path": "t5-small",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "v",
    "q"
  ],
  "task_type": "SEQ_2_SEQ_LM"
}